app/controllers/cosmes_controller.rb

 def create
   @cosme = Cosme.new(cosme_params)
   @cosme.user_id = current_user.id
   @cosme.save
---
INSERT INTO "cosmes" ("name", "caption", "image_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

 def index
   @cosmes = Cosme.all
---
SELECT "cosmes".* FROM "cosmes"

 def show
   @cosme = Cosme.find(params[:id])
---
SELECT  "cosmes".* FROM "cosmes" WHERE "cosmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

 def destroy
   @cosme = Cosme.find(params[:id])
   @cosme.destroy
---
SELECT  "cosmes".* FROM "cosmes" WHERE "cosmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cosmes" WHERE "cosmes"."id" = ?  [["id", 1]]